{
  "architectures": [
    "MobileNetV2ForImageClassification"
  ],
  "classifier_dropout_prob": 0.8,
  "depth_divisible_by": 8,
  "depth_multiplier": 1.0,
  "dtype": "float32",
  "expand_ratio": 6,
  "finegrained_output": true,
  "first_layer_is_expansion": true,
  "hidden_act": "relu6",
  "id2label": {
    "0": "Apple Brown_spot",
    "1": "Apple Normal",
    "2": "Apple black_spot",
    "3": "Apricot Normal",
    "4": "Apricot blight leaf disease",
    "5": "Apricot shot_hole",
    "6": "Bean Fungal_leaf disease",
    "7": "Bean Normal leaf",
    "8": "Bean bean rust image",
    "9": "Bean shot_hole",
    "10": "Cherry Leaf Scorch",
    "11": "Cherry Normal leaf",
    "12": "Cherry brown_spot",
    "13": "Cherry purple leaf spot",
    "14": "Cherry_shot hole disease",
    "15": "Corn Fungal leaf",
    "16": "Corn Normal leaf",
    "17": "Corn gray leaf spot",
    "18": "Corn holcus_ leaf spot",
    "19": "Fig Blight_leaf disease",
    "20": "Fig Brown spot",
    "21": "Fig normal leaf",
    "22": "Fig_rust leaf",
    "23": "Grape Anthracnose leaf",
    "24": "Grape Brown spot leaf",
    "25": "Grape Downy mildew leaf",
    "26": "Grape Mites_leaf disease",
    "27": "Grape Normal_leaf",
    "28": "Grape Powdery_mildew leaf",
    "29": "Grape shot hole leaf disease",
    "30": "Lokat Normal leaf",
    "31": "Pear Black spot _ leaf disease",
    "32": "Pear Normal _leaf",
    "33": "Pear fire blight",
    "34": "Walnut Anthracnose_leaf disease",
    "35": "Walnut Blotch_leaf disease",
    "36": "Walnut Normal_leaf",
    "37": "Walnut Shot_hole",
    "38": "Walnut leaf gall mite",
    "39": "lokat Leaf_spot",
    "40": "persimmons Brown_spot",
    "41": "tomato Fusarium Wilt",
    "42": "tomato spider mites",
    "43": "tomato verticillium wilt",
    "44": "tomato_bacterial_spot",
    "45": "tomato_early_blight",
    "46": "tomato_healthy_leaf",
    "47": "tomato_late_blight",
    "48": "tomato_leaf_curl",
    "49": "tomato_leaf_miner",
    "50": "tomato_leaf_mold",
    "51": "tomato_septoria_leaf"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "label2id": {
    "Apple Brown_spot": 0,
    "Apple Normal": 1,
    "Apple black_spot": 2,
    "Apricot Normal": 3,
    "Apricot blight leaf disease": 4,
    "Apricot shot_hole": 5,
    "Bean Fungal_leaf disease": 6,
    "Bean Normal leaf": 7,
    "Bean bean rust image": 8,
    "Bean shot_hole": 9,
    "Cherry Leaf Scorch": 10,
    "Cherry Normal leaf": 11,
    "Cherry brown_spot": 12,
    "Cherry purple leaf spot": 13,
    "Cherry_shot hole disease": 14,
    "Corn Fungal leaf": 15,
    "Corn Normal leaf": 16,
    "Corn gray leaf spot": 17,
    "Corn holcus_ leaf spot": 18,
    "Fig Blight_leaf disease": 19,
    "Fig Brown spot": 20,
    "Fig normal leaf": 21,
    "Fig_rust leaf": 22,
    "Grape Anthracnose leaf": 23,
    "Grape Brown spot leaf": 24,
    "Grape Downy mildew leaf": 25,
    "Grape Mites_leaf disease": 26,
    "Grape Normal_leaf": 27,
    "Grape Powdery_mildew leaf": 28,
    "Grape shot hole leaf disease": 29,
    "Lokat Normal leaf": 30,
    "Pear Black spot _ leaf disease": 31,
    "Pear Normal _leaf": 32,
    "Pear fire blight": 33,
    "Walnut Anthracnose_leaf disease": 34,
    "Walnut Blotch_leaf disease": 35,
    "Walnut Normal_leaf": 36,
    "Walnut Shot_hole": 37,
    "Walnut leaf gall mite": 38,
    "lokat Leaf_spot": 39,
    "persimmons Brown_spot": 40,
    "tomato Fusarium Wilt": 41,
    "tomato spider mites": 42,
    "tomato verticillium wilt": 43,
    "tomato_bacterial_spot": 44,
    "tomato_early_blight": 45,
    "tomato_healthy_leaf": 46,
    "tomato_late_blight": 47,
    "tomato_leaf_curl": 48,
    "tomato_leaf_miner": 49,
    "tomato_leaf_mold": 50,
    "tomato_septoria_leaf": 51
  },
  "layer_norm_eps": 0.001,
  "min_depth": 8,
  "model_type": "mobilenet_v2",
  "num_channels": 3,
  "output_stride": 32,
  "problem_type": "single_label_classification",
  "semantic_loss_ignore_index": 255,
  "tf_padding": true,
  "transformers_version": "5.0.0"
}
