{
  "architectures": [
    "MobileNetV2ForImageClassification"
  ],
  "classifier_dropout_prob": 0.8,
  "depth_divisible_by": 8,
  "depth_multiplier": 1.0,
  "dtype": "float32",
  "expand_ratio": 6,
  "finegrained_output": true,
  "first_layer_is_expansion": true,
  "hidden_act": "relu6",
  "id2label": {
    "0": "Pepper__bell___Bacterial_spot",
    "1": "Pepper__bell___healthy",
    "2": "Potato___Early_blight",
    "3": "Potato___Late_blight",
    "4": "Potato___healthy",
    "5": "Tomato_Bacterial_spot",
    "6": "Tomato_Early_blight",
    "7": "Tomato_Late_blight",
    "8": "Tomato_Leaf_Mold",
    "9": "Tomato_Septoria_leaf_spot",
    "10": "Tomato_Spider_mites_Two_spotted_spider_mite",
    "11": "Tomato__Target_Spot",
    "12": "Tomato__Tomato_YellowLeaf__Curl_Virus",
    "13": "Tomato__Tomato_mosaic_virus",
    "14": "Tomato_healthy"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "label2id": {
    "Pepper__bell___Bacterial_spot": 0,
    "Pepper__bell___healthy": 1,
    "Potato___Early_blight": 2,
    "Potato___Late_blight": 3,
    "Potato___healthy": 4,
    "Tomato_Bacterial_spot": 5,
    "Tomato_Early_blight": 6,
    "Tomato_Late_blight": 7,
    "Tomato_Leaf_Mold": 8,
    "Tomato_Septoria_leaf_spot": 9,
    "Tomato_Spider_mites_Two_spotted_spider_mite": 10,
    "Tomato__Target_Spot": 11,
    "Tomato__Tomato_YellowLeaf__Curl_Virus": 12,
    "Tomato__Tomato_mosaic_virus": 13,
    "Tomato_healthy": 14
  },
  "layer_norm_eps": 0.001,
  "min_depth": 8,
  "model_type": "mobilenet_v2",
  "num_channels": 3,
  "output_stride": 32,
  "problem_type": "single_label_classification",
  "semantic_loss_ignore_index": 255,
  "tf_padding": true,
  "transformers_version": "5.0.0"
}
